<?php

defined('BASEPATH') OR exit('No direct script access allowed');

class Soal_model extends CI_Model {
    public function get_soal_istimav1(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>إختبار اللغة العربية لغير الناطقين بها</center></p>
                    <p><center>القسم الأول : فهم المسموع</center></p>
                    <p><center>في هذا القسم 50 سؤالا تتكون من ثلاثة أنواع : التعبيرات، و الحوارات، و الفقرات:</center></p>
                    <p><center>للإجابة عن الأسئلة من رقم واحد إلى رقم خمسة وعشرين، استمع إلى التعبيرات ثم اختر أنسب جواب بعد كل تعبير :</center></p>
                "
            ],
            [
                "tipe" => "audio",
                "data" => "v1 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "",
                    "pilihan" => [
                        "في يوم الإثنين",
                        "بالحافلة",
                        "نعم هو يذهب إلى الجامعة",
                        "لأنه طالب مجتهد",
                    ],
                    "jawaban" => "بالحافلة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "",
                    "pilihan" => [
                        "سأكون مدرسا",
                        "نعم ، أخي تاجر",
                        "لا هو تاجر",
                        "أبي طبيب",
                    ],
                    "jawaban" => "سأكون مدرسا"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "",
                    "pilihan" => [
                        "هذا دكتور إبراهيم",
                        "نعم هو محاضر",
                        "في الأسبوع القادم",
                        "نعم، في الجامعة",
                    ],
                    "jawaban" => "في الأسبوع القادم"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "",
                    "pilihan" => [
                        "الممرض",
                        "الطبيب",
                        "الشرطى",
                        "الفلاح",
                    ],
                    "jawaban" => "الفلاح"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "",
                    "pilihan" => [
                        "معاني القرآن الكريم",
                        "سور القرآن الكريم",
                        "أسماء القرآن الكريم",
                        "إعجاز القرآن",
                    ],
                    "jawaban" => "معاني القرآن الكريم"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "",
                    "pilihan" => [
                        "لا يتناول الغداء",
                        "يتناول العشاء",
                        "لا يتناول الفطور",
                        "يتناول الفطور",
                    ],
                    "jawaban" => "لا يتناول الفطور"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "",
                    "pilihan" => [
                        "وصل المسافرون المطار و لم تصل الطائرة",
                        "وصلت الطائرة و يصل المسافرون",
                        "وصل المسافرون المطار بعد مغادرة الطائرة",
                        "ركب المسافرون الطائرة و غادروا المطار",
                    ],
                    "jawaban" => "وصل المسافرون المطار بعد مغادرة الطائرة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "",
                    "pilihan" => [
                        "مكارم الأخلاق",
                        "الأخلاق",
                        "غرض البعث",
                        "الرسول",
                    ],
                    "jawaban" => "غرض البعث"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "",
                    "pilihan" => [
                        "بدأ الإمتحان في السابعة و النصف",
                        "بدأ الإمتحان في الثامنة و النصف",
                        "بدأ الإمتحان في التاسعة تماما",
                        "بدأ الإمتحان في السابعة إلا النصف",
                    ],
                    "jawaban" => "بدأ الإمتحان في السابعة و النصف"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "",
                    "pilihan" => [
                        "الشبكة الدولية",
                        "السفن",
                        "الطائرات",
                        "الحافلة",
                    ],
                    "jawaban" => "الشبكة الدولية"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "",
                    "pilihan" => [
                        "النظافة",
                        "النوم مبكرا",
                        "الوضوء",
                        "الاغتسال بعد النوم",
                    ],
                    "jawaban" => "النظافة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "",
                    "pilihan" => [
                        "لأن القرد نظر إليهم",
                        "لأن القرد في رقبته سلسلة",
                        "لأن القرد كان يرقص",
                        "لأن القرد أخذ العصا",
                    ],
                    "jawaban" => "لأن القرد كان يرقص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "",
                    "pilihan" => [
                        "أن الله يحبّ المؤمن الضعيف أكثر من القويّ",
                        "أن الله يحبّ المؤمن القوي أكثر من الضعيف",
                        "المؤمن الضعيف مثل المؤمن القويّ",
                        "أن الله يحبّ المؤمن",
                    ],
                    "jawaban" => "أن الله يحبّ المؤمن القوي أكثر من الضعيف"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "",
                    "pilihan" => [
                        "طبيب",
                        "مريض",
                        "ممرض",
                        "صيدلي",
                    ],
                    "jawaban" => "طبيب"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "",
                    "pilihan" => [
                        "طبيب",
                        "طالب",
                        "دكتور",
                        "مريض",
                    ],
                    "jawaban" => "دكتور"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "",
                    "pilihan" => [
                        "اشتري الحاسوب",
                        "طلب مبلغا كبيرا من المال",
                        "لم يشتر الحاسوب",
                        "عنده مبلغ كبير",
                    ],
                    "jawaban" => "لم يشتر الحاسوب"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "",
                    "pilihan" => [
                        "الطعام مفيد",
                        "العملُ مهمٌّ",
                        "المالُ فيه خير",
                        "اتّباع بالأنبياء مهم",
                    ],
                    "jawaban" => "العملُ مهمٌّ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "",
                    "pilihan" => [
                        "ليلة التي خير من ألف شهر",
                        "شهر رمضان",
                        "نزول القران",
                        "ليلة القدر",
                    ],
                    "jawaban" => "شهر رمضان"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "",
                    "pilihan" => [
                        "الحادية عشرة",
                        "الحادية عشرة والنصف",
                        "الثانية عشرة والنصف",
                        "الثانية عشرة إلا النصف",
                    ],
                    "jawaban" => "الثانية عشرة والنصف"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "",
                    "pilihan" => [
                        "خمسين مسافرا",
                        "ستين مسافرا",
                        "خمسة و عشرين مسافرا",
                        "عشرين مسافرا",
                    ],
                    "jawaban" => "خمسين مسافرا"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "",
                    "pilihan" => [
                        "الطلاب سوف يواجهون الامتحان",
                        "نصيحة المدرس لطلابه قبل الامتحان",
                        "الطلاب يدرسون بجهد",
                        "المدرس سوف يواجه الامتحان",
                    ],
                    "jawaban" => "نصيحة المدرس لطلابه قبل الامتحان"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "",
                    "pilihan" => [
                        "السادسة",
                        "الثامنة",
                        "التاّسعة",
                        "السابعة",
                    ],
                    "jawaban" => "السابعة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "",
                    "pilihan" => [
                        "المدينة المنوّرة",
                        "جدّة",
                        "مكّة المكرمة",
                        "المنزل",
                    ],
                    "jawaban" => "مكّة المكرمة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "",
                    "pilihan" => [
                        "عبد الرحمن و أبوه",
                        "أبو عبد الرحمن",
                        "عبد الرحمن",
                        "أم عبد الرّحمن",
                    ],
                    "jawaban" => "أبو عبد الرحمن"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "",
                    "pilihan" => [
                        "في المطار",
                        "في مكان الاستئجار",
                        "في جاكرتا",
                        "في البيت",
                    ],
                    "jawaban" => "في مكان الاستئجار"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم ستة وعشرين إلى رقم أربعين، استمع إلى الحوارات ثم اختر أنسب جواب بعد كل تعبير :</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak2.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "",
                    "pilihan" => [
                        "يعمل الآن طبيبا",
                        "يعمل مهندسا",
                        "لا يعمل",
                        "يعمل مدرسا",
                    ],
                    "jawaban" => "لا يعمل"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "",
                    "pilihan" => [
                        "أربع و عشرون سنةً",
                        "ستة وعشرون سنةً",
                        "خمس	و عشرون سنةً",
                        "سبعة و عشرون سنةً",
                    ],
                    "jawaban" => "ستة وعشرون سنةً"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "",
                    "pilihan" => [
                        "في السوق",
                        "في المطعم",
                        "في الفصل",
                        "في المكتبة",
                    ],
                    "jawaban" => "في المكتبة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "",
                    "pilihan" => [
                        "دول الشرق",
                        "دول الشرق الأوسط",
                        "الدول النامية",
                        "الدول الغربية",
                    ],
                    "jawaban" => "الدول النامية"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة السادسة",
                        "في الساعة الثامنة",
                        "في الساعة السابعة",
                        "في الساعة التاسعة",
                    ],
                    "jawaban" => "في الساعة الثامنة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "",
                    "pilihan" => [
                        "في المطعم",
                        "في الفصل",
                        "في السوق",
                        "في المستشفى",
                    ],
                    "jawaban" => "في المطعم"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "",
                    "pilihan" => [
                        "هو مريض",
                        "يصلي الصبح",
                        "لا يعرف الملعب الرياضي",
                        "سيزور أحد أصدقائه",
                    ],
                    "jawaban" => "سيزور أحد أصدقائه"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "",
                    "pilihan" => [
                        "ثلاث سنوات",
                        "خمس سنوات",
                        "سنتين",
                        "أربع  سنوات",
                    ],
                    "jawaban" => "ثلاث سنوات"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم أربعة وثلاثين  إلى سبعة وثلاثين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak3.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "",
                    "pilihan" => [
                        "عمل أبيه",
                        "عمل أخيه",
                        "عمل جده",
                        "اختيار المهنة",
                    ],
                    "jawaban" => "اختيار المهنة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "",
                    "pilihan" => [
                        "طبيب",
                        "طياّر",
                        "مهندس",
                        "مدرّس",
                    ],
                    "jawaban" => "طبيب"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "",
                    "pilihan" => [
                        "مهندسا",
                        "مدرّسا",
                        "طياّرا",
                        "طبيبا",
                    ],
                    "jawaban" => "مدرّسا"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "",
                    "pilihan" => [
                        "الطّبّ",
                        "التّعليم",
                        "الطّيران",
                        "الهندسة",
                    ],
                    "jawaban" => "الطّيران"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم ثمانية وثلاثين  إلى اثنين وأربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak4.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "",
                    "pilihan" => [
                        "رجل وزوجته",
                        "امرأة وابنتها",
                        "أمّ وابنتها",
                        "امرأة وأختها",
                    ],
                    "jawaban" => "أمّ وابنتها"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "",
                    "pilihan" => [
                        "وضع الماء في اللبن",
                        "وضع اللبن في الماء",
                        "بيع اللبن في السوق",
                        "بيع اللبن في بيت عمر",
                    ],
                    "jawaban" => "وضع الماء في اللبن"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "",
                    "pilihan" => [
                        "الله",
                        "الابنة",
                        "الأمّ",
                        "الأخت",
                    ],
                    "jawaban" => "الابنة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "",
                    "pilihan" => [
                        "زوج المرأة",
                        "الأب",
                        "عمر",
                        "الله",
                    ],
                    "jawaban" => "عمر"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "",
                    "pilihan" => [
                        "الابنة",
                        "الأمّ",
                        "عمر",
                        "لا أحد",
                    ],
                    "jawaban" => "لا أحد"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center> للإجابة عن الأسئلة من رقم ثلاثة وأربعين إلى خمسة وأربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "",
                    "pilihan" => [
                        "حياة الناس",
                        "فوائد السفر",
                        "بلاد العالم",
                        "السفارة",
                    ],
                    "jawaban" => "فوائد السفر"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "",
                    "pilihan" => [
                        "أربع قارات",
                        "ست قارات",
                        "خمس قارات",
                        "قارات كثيرة",
                    ],
                    "jawaban" => "خمس قارات"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "",
                    "pilihan" => [
                        "السفر",
                        "الأمم الأخرى",
                        "الإستماع",
                        "القراءة",
                    ],
                    "jawaban" => "السفر"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم ستة وثلاثين  إلى خمسين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak6.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "",
                    "pilihan" => [
                        "في المطار",
                        "في لندن",
                        "في بلده",
                        "في الطائرة",
                    ],
                    "jawaban" => "في لندن"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "",
                    "pilihan" => [
                        "هو في استقبال صديقه",
                        "ليذهب إلى المستشفى",
                        "للعمل",
                        "للتَنَزُّه",
                    ],
                    "jawaban" => "للعمل"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "",
                    "pilihan" => [
                        "هو مشغول في المكتب",
                        "هو لا يريد السفر",
                        "ستتأخر طائرته",
                        "هو مريض",
                    ],
                    "jawaban" => "ستتأخر طائرته"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "",
                    "pilihan" => [
                        "للسفر إلى لندن",
                        "لاستقبال صديقه",
                        "ليأخذ تذكرة الطائرة",
                        "لطلب العمل",
                    ],
                    "jawaban" => "لاستقبال صديقه"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "",
                    "pilihan" => [
                        "صباح الغد",
                        "مساء اليوم",
                        "بعد الظهر",
                        "هذه الليلة",
                    ],
                    "jawaban" => "صباح الغد"
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv1(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>القسم الثاني : فهم التراكيب والتعبيرات</center></p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'اشترى أحمد سبعة ...',
                    "pilihan" => [
                        "كتبٍ",
                        "كتابا",
                        "كتابٍ",
                        "كتابٌ"
                    ],
                    "jawaban" => "كتبٍ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'الإتحاد أساس النجاح. الإتحاد في هذه الجملة تكون ؟',
                    "pilihan" => [
                        "فاعل",
                        "نائب الفاعل",
                        "مبتدأ",
                        "خبر"
                    ],
                    "jawaban" => "مبتدأ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'نشأت اللغة العربية في جزيرة العرب قبل الإسلام.إعراب  "الإسلام" في هذه الجملة؟',
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجرور",
                        "مجزوم"
                    ],
                    "jawaban" => "مجرور",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'كان في المدرسة أستاذ مَشْهُوْرٌ. اسم كان في هذه الجملة ؟',
                    "pilihan" => [
                        "كان",
                        "في المدرسة",
                        "المدرس",
                        "أستاذ"
                    ],
                    "jawaban" => "أستاذ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'لا شكّ أن اللغة العربية ..... في ديننا للمسلمين والمسلمات.',
                    "pilihan" => [
                        "لغةً مهمةً",
                        "لغةٍ مهمةٍ",
                        "لغةَ مهمةٍ",
                        "لغةٌ مهمةٌ"
                    ],
                    "jawaban" => "لغةٌ مهمةٌ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => 'أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني ........؟',
                    "pilihan" => [
                        "جديدا",
                        "جديدٍ",
                        "جديدةً",
                        "جديدةٍ"
                    ],
                    "jawaban" => "جديدةً",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => '........ مشكلة الأفراد في مواجهة الحياة',
                    "pilihan" => [
                        "تختلف",
                        "يختلف",
                        "أختلف",
                        "نختلف"
                    ],
                    "jawaban" => "تختلف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'صاد الرجل الأسماك الكثيرة هذه الليلة. کلمة <b>الكثيرة</b> فی الجملة السابقة؟',
                    "pilihan" => [
                        "مضاف إلیه",
                        "مفعول",
                        "توكيد",
                        "نعت"
                    ],
                    "jawaban" => "نعت"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'لا أصدق بما قاله عدنان عن هذا الخبر. "ما" فی الجملة السابقة؟',
                    "pilihan" => [
                        "تعجبیة",
                        "موصولة",
                        "استفهامیة",
                        "نافیة"
                    ],
                    "jawaban" => "موصولة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'قال تعالی: (قال رب إنی وهن العظم منی و اشتعل الرأس شیبا. کلمة (شیبا) ؟',
                    "pilihan" => [
                        "منصوب",
                        "مرفوع",
                        "مجرور",
                        "مجزوم"
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => 'قال تعالی: ( إن الإنسان خلق هلوعا. کلمة (هلوعا) هي؟',
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "اسم إن",
                        "تمییز"
                    ],
                    "jawaban" => "حال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => 'مرحلة الشباب أهم <u>مرحلة</u> في حياة الإنسان، وأغلى <u>ثروة</u> عند الأمة. ما الإعراب من كلمة التي تحتها خط؟',
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجزوم",
                        "مجرور"
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => 'بین هذه الجمل جملة صحیحة هي؟',
                    "pilihan" => [
                        "حاولت فاطمة أن تنهي كتابة الرسالة هذه السنة",
                        "حاول فاطمة أن تنهي كتابة الرسالة هذه السنة",
                        "حاولتا فاطمة أن تنهي كتابة الرسالة هذه السنة",
                        "حاولت فاطمة أن ينهي كتابة الرسالة هذه السنة"
                    ],
                    "jawaban" => "حاولت فاطمة أن تنهي كتابة الرسالة هذه السنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => 'الموظفان يعملان في شريكة الطباعة معا. الموظفان في هذه الجملة؟',
                    "pilihan" => [
                        "مبتدأ مرفوع بالألف",
                        "مبتدأ مرفوع بالنون",
                        "خبر مرفوع بالألف",
                        "خبر مرفوع  بالنون"
                    ],
                    "jawaban" => "مبتدأ مرفوع بالألف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'قال: <u>لا تُظلمْ</u> الناس فتندم. الكلمة التي تحتها خط هي؟',
                    "pilihan" => [
                        "فعل ماض",
                        "فعل الأمر",
                        "الفعل الناهي",
                        "اسم فعل"
                    ],
                    "jawaban" => "الفعل الناهي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'هذه الجامعة مناسبة لمن يريدون أن يعمقوا علوما طبية. كلمة مناسبة؟',
                    "pilihan" => [
                        "خبر",
                        "مبتدأ",
                        "نعت",
                        "موصوف"
                    ],
                    "jawaban" => "خبر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => '...... الأم الدجاجة المشوية في الصباح لأنني أحب بهذا الطبخ. ',
                    "pilihan" => [
                        "طبخت",
                        "طبخ",
                        "طبختا",
                        "طبخوا"
                    ],
                    "jawaban" => "طبخت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => 'الجد والجدة  ..... في سعادة مع أولادهما و أحفادهما. ',
                    "pilihan" => [
                        "يعيشان",
                        "يعيش",
                        "تعيش ",
                        "تعيشان "
                    ],
                    "jawaban" => "يعيشان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => '...... الأساتيذ الطلاب والطالبات أن يراجعوا الدروس لمقابلة الاختبار الآخر في هذه المدرسة. ',
                    "pilihan" => [
                        "يأمرون",
                        "يأمر",
                        "تأمرون",
                        "تأمر"
                    ],
                    "jawaban" => "يأمر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => 'كثير من الناس ......  بذكري مولدي النبي صلى الله عليه وسلم ',
                    "pilihan" => [
                        "يفكرون",
                        "يسمعون",
                        "ينظرون",
                        "يحتفلون"
                    ],
                    "jawaban" => "يحتفلون"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'يريد صالح أن يذهب إلى مصر في الأسبوع القادم.  القادم في هذه الجملة تعني؟ ',
                    "pilihan" => [
                        "الماضي",
                        "الآتي",
                        "أمس",
                        "الآن"
                    ],
                    "jawaban" => "الآتي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'صبح لاعب كرة القدم مشهورا بسبب صناعة هدف ......',
                    "pilihan" => [
                        "رائعٍ",
                        "رائعٌ",
                        "رائعاً",
                        "رائعين"
                    ],
                    "jawaban" => "رائعٍ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => 'أن تحفظ العالم – يجب علينا – حولنا – مهم لحياة الناس – لأن حفظ العالم. ',
                    "pilihan" => [
                        "يجب علينا حولنا أن نحفظ العالم لأن حفظ العالم مهم لحياة الناس",
                        "أن نحفظ العالم حولنا مهم لحياة الناس لأن حفظ العالم يجب علينا",
                        "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
                        "مهم لحياة الناس أن نحفظ العالم لأن حفظ العالم حولنا يجب علينا"
                    ],
                    "jawaban" => "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => ' ليست – الشهادة – الدراسة – لنيل– أغراض – إن- فحسب <br>الترتيب الصحيح مِن الكَلِماتِ السَابِقَةِ هُوَ.......',
                    "pilihan" => [
                        "ليست لنيل الشهادة إن أغراض الدراسة فحسب",
                        "إن فحسب أغراض الدراسة ليست لنيل الشهادة",
                        "إن أغراض الدراسة ليست لنيل الشهادة فحسب",
                        "إن أغراض الدراسة لنيل الشهادة ليست فحسب "
                    ],
                    "jawaban" => "إن أغراض الدراسة ليست لنيل الشهادة فحسب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => 'تجتهد – إن – في الإمتحان – تنجح  <br>الترتيب الصحيح من الكلمات السابقة هو....... ',
                    "pilihan" => [
                        "تجتهد في الامتحان إن تنجح ",
                        "إن  تنجح تجتهد في الامتحان",
                        "إن تجتهد تنجح في الامتحان",
                        "إن تنجح  في الإمتحان تجتهد"
                    ],
                    "jawaban" => "إن تجتهد تنجح في الامتحان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => ' يقاس تقدم الدول - اليوم - بالنظافة، فإذا كانت الدولة وسكانها يهتمون بالنظافة، فهي دولة متحضرة، وإذا كانت الدولة وسكانها لا يهتمون بالنظافة، فهي دولة متخلفة. أين نائب الفاعل في هذه العبارة؟',
                    "pilihan" => [
                        "تقدم الدول",
                        "بالنظافة",
                        "اليوم",
                        "وسكانها"
                    ],
                    "jawaban" => "تقدم الدول",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'لن ترجع الأيام التي مضت. ترجع في هذه الجملة؟',
                    "pilihan" => [
                        "منصوب بالفتحة",
                        "منصوب بالألف",
                        "منصوب بالكسرة",
                        "منصوب بحذف حرف العلة"
                    ],
                    "jawaban" => "منصوب بالفتحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => 'الموضوع الذي قدمه الدكتور في هذه المحاضرة <u>مناسب</u> بحال الناس في هذا العصر. الكلمة التي تحتها خط تعني؟',
                    "pilihan" => [
                        "متجانس",
                        "لائق",
                        "مفيد",
                        "منخفض"
                    ],
                    "jawaban" => "لائق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => ' لا يوافق أكثر الحاضرين برأي رئيس القرية عن أمور مجيئ الضيوم من خارج البلاد لاحتفال يوم استقلال اندونيسي. هذه العبارة تعني؟',
                    "pilihan" => [
                        "لا يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                        "يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                        "يوجد بعض الضيوم من خارج البلاد  في يوم الاستقلال",
                        "لا يوجد يوم الاستقلال "
                    ],
                    "jawaban" => "لا يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => '<u>اقترح</u> أحد السكان في هذه القرية لصناعة الجسر بين قريتين لتسهيل المرور بينهما. ماذا نقصد  الكلمة التي تحتها خد؟',
                    "pilihan" => [
                        "قدم رأيا",
                        "قدم جسرا",
                        "قدم مالا",
                        "قدم سكان "
                    ],
                    "jawaban" => "قدم رأيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => '<u>كانوا</u> الإنسان <u>في</u> هذا العصر <u>لا يهتمون</u> <u>بالتربية</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "كانوا",
                        "في",
                        "لا يهتمون",
                        "بالتربية"
                    ],
                    "jawaban" => "كانوا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => '<u>يبني</u> <u>المهندس</u> <u>هذا البناء</u> العالي بعشرة <u>يوم</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "يبني",
                        "هذا البناء",
                        "يوم",
                        "المهندس"
                    ],
                    "jawaban" => "يوم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => '<u>تفحص</u> الطبيبة <u>المريض</u> في <u>هذه</u> المستشفي  <u>بكل فرح</u> وسرور. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "تفحص",
                        "المريض",
                        "هذه",
                        "بكل فرح"
                    ],
                    "jawaban" => "هذه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => '<u>كان</u> المدافع في هذه المباراة <u>يرفسون</u> الكرة بشدة حتى <u>يحصل</u> على <u>الهدف</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟ ',
                    "pilihan" => [
                        "كان",
                        "يرفسون",
                        "يحصل",
                        "الهدف"
                    ],
                    "jawaban" => "يرفسون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => '<u>يزور</u> الطلاب والطالبات <u>المتاحف</u> <u>المتنوعة</u> لزيادة <u>المعلوماتُ</u> .  ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "يزور",
                        "المتاحف",
                        "المتنوعة",
                        "المعلوماتُ"
                    ],
                    "jawaban" => "المعلوماتُ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => '<u>يستمعون</u> <u>الطلاب</u> محاضرة عميد <u>الجامعة</u> في الجامعة <u>الإسلامية</u>. ما هي الكلمة الخاطئة من هذه الجملة؟',
                    "pilihan" => [
                        "يستمعون",
                        "الطلاب",
                        "الجامعة",
                        "الإسلامية"
                    ],
                    "jawaban" => "يستمعون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => '<u>مشكلة الأسرة</u> <u>يؤدي</u> إلى نجاح <u>أولادهم</u> في <u>المدرسة</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "مشكلة الأسرة",
                        "يؤدي",
                        "أولادهم",
                        "المدرسة"
                    ],
                    "jawaban" => "يؤدي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                    "pilihan" => [
                        "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
                        "تبحرت هذا الرجل في علم النحو والصرف والبلاغة",
                        "تبحروا هذا الرجل في علم النحو والصرف والبلاغة",
                        "تبحرا هذا الرجل في علم النحو والصرف والبلاغة"
                    ],
                    "jawaban" => "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                    "pilihan" => [
                        "ليس للمسلمين عدوٌّ ",
                        "ليس للمسلمين عدوًّا",
                        "ليس للمسلمين عدوٍّ",
                        "ليس للمسلمين عدوين"
                    ],
                    "jawaban" => "ليس للمسلمين عدوٌّ ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                    "pilihan" => [
                        "الطلاب لم يرموا الزبالة في أي مكان",
                        "الطلاب لم يرمون الزبالة في أي مكان",
                        "الطلاب لم يرم الزبالة في أي مكان",
                        "الطلاب لم يرمي الزبالة في أي مكان"
                    ],
                    "jawaban" => "الطلاب لم يرموا الزبالة في أي مكان",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_qiroahv1(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>القسم الثالث: فهم المقروء</center></p>
                    <p>نشأت اللغة العربية في جزيرة العرب قبل الإسلام، وكان العرب قبائل متفرقة، وكانت لبعض القبائل لهجات خاصة بها. وكانت الاختلافات قليلة بين تلك اللهجات. وكانت للعرب لغة مشتركة، هي اللغة العربية الفصيحة، لغة الشعر والخطابة، التي كان العرب يتحدثون بها. ثم جاء الإسلام، وأنزل الله القرآن الكريم، باللغة العربية الفصيحة. قال الله تعالى: (إنا أنزلناه قرآنًا عربيا لعلكم تعقلون).</p>
                    <p>أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة، وجاء بأساليب جديدة، لم تعرفها العربية من قبل. وكان القرآن سببًا في نشأة علوم اللغة العربية؛ كالنحو والصرف، والبلاغة، والعلوم الإسلامية، كعلم التفسير والحديث والفقه وغيرها.</p>
                    <p>أثرت اللغة العربية في لغات الشعوب الإسلامية، كالفارسية والأردية والسواحلية، فأقرضتها كثيرًا من الألفاظ، وكتب كثير من تلك اللغات بالحرف العربي. واقترضت لغات أخرى بعض الألفاظ العربية، مثل: الإنجليزية والفرنسية والإسبانية.</p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'عما تتحدث الفقرة السابقة؟',
                    "pilihan" => [
                        "اللغة العربية ",
                        "اللغة العربية الفصيحة وآثرها",
                        "الجزيرة العربية ",
                        "الدولة العربية ",
                    ],
                    "jawaban" => "اللغة العربية الفصيحة وآثرها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'ما المرادف من كلمة "نَشَأَتْ " من تلك الفقرة ؟',
                    "pilihan" => [
                        "صارت",
                        "ارتقت",
                        "كبرت",
                        "أصبحت",
                    ],
                    "jawaban" => "ارتقت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'متي نشأت اللغة العربية ؟',
                    "pilihan" => [
                        "بعد الاسلام ",
                        "قبل الاسملام ",
                        "في عصر الخلافة ",
                        "في عصر الحديث ",
                    ],
                    "jawaban" => "قبل الاسملام ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'كل هذه العبارة مخطيئة. إلا ؟',
                    "pilihan" => [
                        "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة",
                        "أعطى القرآن الكريم بعض الألفاظ العربية الجديدة معاني جديدة",
                        "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني صحيحة",
                        "أعطى القرآن الكريم بعض الألفاظ العربية الصحيحة معاني جديدة",
                    ],
                    "jawaban" => "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'ما سبب نشأة علوم اللغة العربية ؟',
                    "pilihan" => [
                        "الحديث ",
                        "الفقه",
                        "القرآن",
                        "الشعب ",
                    ],
                    "jawaban" => "القرآن",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>یا محمد ابعث  لی هذه الرسالة بالبرید الإلکترونی إلی الحج یوسف فی کوالالمبور، واکتب له أن یحضر إلینا هنا فی الریاض بعد رمضان مباشرة.  حتی ندخل الشبکة الدولیة إلی مکتبنا فی اليبان کما فعلنا فی مکتبنا فی کوریا.</p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => 'أین یوسف الآن؟',
                    "pilihan" => [
                        "فی کوریا",
                        "فی مالیزیا",
                        "فی الیابان",
                        "فی الریاض",
                    ],
                    "jawaban" => "فی مالیزیا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => 'متی سیحضر یوسف إلی الریاض؟',
                    "pilihan" => [
                        "‌فی رمضان",
                        "‌فی شعبان",
                        "‌فی شوال",
                        "‌قبل رمضان",
                    ],
                    "jawaban" => "‌فی شوال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'ما المرادف من كلمة "المكتب" في تلك الفقرة؟',
                    "pilihan" => [
                        "‌المكتبة",
                        "‌المدرسة",
                        "‌الديوان",
                        "‌الفصل",
                    ],
                    "jawaban" => "‌الديوان",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>أصبحت مشكلة زيادة السكان من أهم المشكلات التى تعانى منها معظم دول العالم، وقد اتجهت معظم هذه الدول إلى تحديد النسل، فالصين-ألف مليون نسمة – قد حددت النسل طفلا للأسرة الواحدة وما زاد عن ذلك فهناك عقاب صارم للأبوين، ولكن الشعب الصينى مطيع للأوامر ولم تشذ عن هذا القانون إلا حالا تحددها الأطباء، وقد جعلت هذه المشكلة مشكلات اقتصادية واجتماعية كثيرة.</p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'الفكرة الرئيسة للفقرة السابقة هى :',
                    "pilihan" => [
                        "عدد سكان الصين ألف مليون نسمة.",
                        "تحديد النسل يكون عن طريق تحديد طفل واحد للأسرة.",
                        "زيادة السكان من أهم مشكلات معظم دول العالم.",
                        "القانون يعاقب من لايطيع قانون تحديد النسل.",
                    ],
                    "jawaban" => "زيادة السكان من أهم مشكلات معظم دول العالم.",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'كيف حددت الصين النسل :',
                    "pilihan" => [
                        "طفل واحد لكل أسرة.",
                        "طفلين للأسرة.",
                        "طفلين للأسرتين.",
                        "ثلاثة أطفال للأسرة.",
                    ],
                    "jawaban" => "طفل واحد لكل أسرة.",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => 'أدى تزايد السكان إلى :',
                    "pilihan" => [
                        "مشكلة اقتصادية",
                        "مشكلات اجتماعية",
                        "مشكلات سياسية",
                        "مشكلات اقتصادية واجتماعية",
                    ],
                    "jawaban" => "مشكلات اقتصادية واجتماعية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => 'ولكن <u>الشعب</u> <u>الصينى</u> <u>مطيع</u> <u>للأوامر</u> ولم تشذ عن هذا القانون إلا حالا تحددها الأطباء مشكلة اقتصادية. أين خبر لكنّ ؟',
                    "pilihan" => [
                        "للأوامر",
                        "الشعب",
                        "الصيني",
                        "مطيع",
                    ],
                    "jawaban" => "مطيع",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>مرحلة الشباب أهم مرحلة في حياة الإنسان، وأغلى ثروة عند الأمة. ومرحلة الشباب هي مرحلة العطاء والعمل. والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره. وكان كثير من أصحاب الرسول - صلى الله عليه وسلم - من الشباب، وقد ولاهم مسؤوليات كبيرة؛ حيث ولى كثيرا منهم قيادة الجيش، وفيه شيوخ المهاجرين والأنصار؛ فقد ولى زيد بن حارثة، وجعفر بن أبي طالب، وعبد الله بن أبي رواحة، قيادة الجيش في غزوة مؤتة، كما ولى أسامة بن زيد قيادة الجيش الإسلامي، لغزو الروم، وعمره ثماني عشرة سنة، وأرسل معاذ بن جبل قاضيا إلى اليمن، وهو في مرحلة الشباب.</p>
                    <p>تحتاج الأمة إلى الشاب القوي الجاد، الذي يعطي أكثر مما يأخذ، ولا تحتاج إلى الشاب الكسلان، الذي يهتم بطعامه ومظهره فقط، ولا يحب العمل والعطاء. وكما تحتاج الأمة إلى قوة الشباب، تحتاج إلى خبرة الشيوخ، حتى تتقدم البلاوتخطئ الأمة إذا اعتمدت على قوة الشباب وحدهم، وأهملت خبرات الشيوخ. وهذا يعني أن تكون هناك علاقة طيبة بين جميع أفراد المجتمع، كبارا وصغارا، رجالا ونساء، حتى تصل الأمة إلى ما تريد.</p>",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => 'ما الموضوع المناسب لهذا النص ؟',
                    "pilihan" => [
                        "مرحلة الشباب",
                        "مرحلة الرجولة",
                        "حياة الشباب",
                        "الحياة البشرية المتعددة ",
                    ],
                    "jawaban" => "مرحلة الشباب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => ' ما المضاد من الكلمة " الشباب " حسب النص ؟',
                    "pilihan" => [
                        "الرجال",
                        "الأولاد",
                        "الشابة",
                        "الشيوخ",
                    ],
                    "jawaban" => "الشيوخ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'كل هذه العبارات غير الصحيحة. إلا ؟',
                    "pilihan" => [
                        "مرحلة الشباب ليست من  أهم مرحلة في حياة الإنسان",
                        "مرحلة الشباب هي مرحلة التنزه ",
                        "لا تحتاج الأمة إلى الشاب القوي الجاد",
                        "والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره",
                    ],
                    "jawaban" => "والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'ما المرادف من كلمة " الثروة" في النص ؟',
                    "pilihan" => [
                        "الغني ",
                        "الفقر",
                        "المال",
                        "النقود",
                    ],
                    "jawaban" => "الغني ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => 'ما هو الذي تحتاجه الأمة من الشباب ؟',
                    "pilihan" => [
                        "تحتاج الأمة إلى الشاب القوي الجاد",
                        "الأمة تحتاج إلي الشباب الغني بالمال",
                        "الامة تحتاج إلي الشباب الكسلان",
                        "الامة تحتاج الي الشباب الغضبان",
                    ],
                    "jawaban" => "تحتاج الأمة إلى الشاب القوي الجاد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => 'المرادف من كلمة "العطاء " في النص ؟',
                    "pilihan" => [
                        "البخيل",
                        "المتكبر",
                        "الإحسان",
                        "الكسلان",
                    ],
                    "jawaban" => "الإحسان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => 'ما معنى "المرحلة" في هذه الفقرة ؟',
                    "pilihan" => [
                        "المستوى",
                        "الجامعة",
                        "الترتيب",
                        "الفروق",
                    ],
                    "jawaban" => "المستوى",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>النظافة نوعان؛ نظافة خاصة، ونظافة عامة. فالنظافة الخاصة نظافة جسم الإنسان وثوبه وطعامه وبيئته. أما النظافة العامة، فنظافة الأماكن العامة، كالشوارع والحدائق. وتقع مسؤولية النظافة الخاصة على الأفراأما مسؤولية النظافة العامة، فتقع على الأفراد والحكومات.</p>
                    <p>يقاس تقدم الدول - اليوم - بالنظافة، فإذا كانت الدولة وسكانها يهتمون بالنظافة، فهي دولة متحضرة، وإذا كانت الدولة وسكانها لا يهتمون بالنظافة، فهي دولة متخلفة. وهناك دول مشهورة في العالم بالنظافة، وهي قليلة مثل ماليزيا وسنغافورة. وهناك دول أخرى مشهورة بالقذارة، وهي كثيرة.</p>
                    <p>تنفق بعض الدول أموالا كثيرة على النظافة، ونشاهد - الآن - في كل مدينة عمال النظافة، يجوبون الشوارع، يحملون حاويات النظافة، ويضعونها في سارات خاصة، تحملها خارج المدينة؛ لتحرق. ويشارك المواطن الدولة الاهتمام بالنظافة، حيث يضع النفايات الخاصة ببيته، والتي يجدها في الشوارع والحدائق في الحاويات، وهذا ما دعا إليه الرسول - صلى الله عليه وسلم - في قوله: (إماطة الأذى عن الطريق صدقة).</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => 'كم نوعا من النظافة حسب النص ؟',
                    "pilihan" => [
                        "نظافة جسمية، ونظافة روحية ",
                        "نظافة غرفة، ونظافة بيت",
                        "نظافة خاصة، ونظافة خارجية",
                        "نظافة خاصة، ونظافة عامة",
                    ],
                    "jawaban" => "نظافة خاصة، ونظافة عامة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'ما الموضوع المناسب لهذا النص ؟',
                    "pilihan" => [
                        "نظافة البيئة",
                        "نظافة البيت",
                        "نظافة الجسم",
                        "نظافة الأمة ",
                    ],
                    "jawaban" => "نظافة الأمة ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'ما المراد بالناظافة الخاصة ؟',
                    "pilihan" => [
                        "نظافة جسم الإنسان وثوبه وطعامه وبيئته",
                        "نظافة قلب الانسان و روحه",
                        "نظافة فكر الانسان و حركته ",
                        "نظافة طعام الانسان وشربه",
                    ],
                    "jawaban" => "نظافة جسم الإنسان وثوبه وطعامه وبيئته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => 'ما هي الدولة المشهورة في العالم بالنظافة حسب النص ؟',
                    "pilihan" => [
                        "ماليزيا وسنغافورة",
                        "مصر و يمان ",
                        "ج.عراق و إيران",
                        "تركي و يابان ",
                    ],
                    "jawaban" => "ماليزيا وسنغافورة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => 'ما المراد بالدولة المتحضرة حسب النص ؟',
                    "pilihan" => [
                        "الدولة وسكانها يهتمون بالنظافة",
                        "الدولة وسكانها يهتمون بالتقدم",
                        "الدولة وسكانها يهتمون بالمال",
                        "الدولة وسكانها يهتمون بالتربية",
                    ],
                    "jawaban" => "الدولة وسكانها يهتمون بالنظافة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => 'ماالمرادف بكلمة " القذارة " في النص ؟',
                    "pilihan" => [
                        "النظافة",
                        "الحديثة",
                        "الجديدة",
                        "الوسخة ",
                    ],
                    "jawaban" => "الوسخة ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>قال الرسول صلّى الله عليه وسلم : بينما رجل يمشي بطريق، اشتدّ عليه العطش، فوجد بئرا، فنزل فيها، فشرب منها ثمّ خرج، فإذا هو بكلب يلهث (يأكل الثرى من العطش) فقال : لقد بلغ هذا الكلب من العطش مثل الذي بلغ بي. فنزل البئر فملأ خفّه ماء، ثمّ أمسكه بفيه، ثمّ رقى، فسقى الكلب، فشكر الله له، فغفر له.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => 'ما العنوان المناسب لهذا الحديث ؟',
                    "pilihan" => [
                        "الرجل العطشان",
                        "الرفق بالحيوان",
                        "الكلب العطشان",
                        "البئر فى الطريق",
                    ],
                    "jawaban" => "الرفق بالحيوان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'ما المرادف من "يلهث" في هذه القراءة ؟',
                    "pilihan" => [
                        "ظمئ",
                        "سبع",
                        "حزن",
                        "بكا",
                    ],
                    "jawaban" => "ظمئ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>هناك اختلافات كثيرة، بين التعليم في الماضي، والتعليم في الحاضر. ومن تلك الاختلافات، أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون، هم - في الغالب - أبناء الأغنياء وسكان المدن. أما اليوم، فقد أصبح التعليم حقا لكل مواطن. فكثر عدد الطلاب، وانتشرت المدارس في كل مكان، وشاع القول: "التعليم كالماء والهواء".</p>
                    <p>كان طلاب العلم - في الماضي - يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب؛ فكانوا يركبون الجمال أياما وأشهرا. أما ليوم، فالمدارس والجامعات كثيرة، في كل مدينة وقرية تقريبا، حيث يذهب الطالب إلى مدرسته، أو جامعته بالسيارة، أو سيرا على الأقدام. ومن ناحية أخرى، يستطيع الطالب أن يتعلم، وهو في بيته عن طريق الشبكة الدولية.</p>
                    <p>من الاختلافات أيضا، أن المعلم كان لا يطلب أجرا على عمله في الماضي؛ لأنه كان يطلب الأجر من الله. وكان هدف الطالب طلب العلم. أما اليوم، فقد اختلف الأمر، فالمعلم يطلب كثيرا من الأجر، والطالب يفكر في الشهادة قبل العلم؛ لأنها وسيلة إلى العمل.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => ' كل هذه العبارات غير الصحيحة. إلا ؟',
                    "pilihan" => [
                        "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                        "أن فرص التعليم، كانت كثيرة  في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                        "أن فرص التعليم، كانت قليلة في المستقبل، حيث كان يلتحق بالمدارس طلاب قليلون",
                        "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب كثيرون ",
                    ],
                    "jawaban" => "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => 'مالفرق بين التعليم في الماضي و التعليم في الحاضر حسب النص ؟',
                    "pilihan" => [
                        "التعليم في الحاضر  والتعليم في الماضي خاصة للأغنياء",
                        "التعليم في الحاضر للأغنياء والتعليم في الماضي لجميع الأفراد",
                        "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للمساكين",
                        "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للأغنياء",
                    ],
                    "jawaban" => "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للأغنياء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => 'كيف كان الطلاب في الماضي حسب النص ؟',
                    "pilihan" => [
                        "يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب",
                        "يذهب الطالب إلى مدرسته، أو جامعته بالسيارة",
                        "يستطيع الطالب أن يتعلم، وهو في بيته عن طريق الشبكة الدولية",
                        "كل العبارات صحيحة ",
                    ],
                    "jawaban" => "يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => 'كيف كان المعلم في الماضي حسب النص ؟',
                    "pilihan" => [
                        "لا يطلب أجرا على عمله",
                        "يطلب أجرا على عمله ",
                        "يستخدمون الأدوات  المتحدثة في التعليم ",
                        "يعلم الطلاب عبر الشبكة الدولية",
                    ],
                    "jawaban" => "لا يطلب أجرا على عمله",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>العمل نعمة من نعم الله، ولا يعرف هذه النعمة، إلا من فقدها بسبب مرض، أو غيره. ومع ذلك فبعض النّاس لا يحبون العمل، ويعتمدون على غيرهم، أو يتسوّلون في الطريق. قال الرسول صلى الله عليه وسلم : ما أكل أحد طعاما قطّ خيرا من أن يأكل من عمل يده، وقال : لأن يأخذ أحدكم حبله، ثمّ يغدو إلى الجبل، فيحتطب، فيبيع، فيأكل، ويتصدّق خير له من أن يسأل النّاس.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => 'ما الفكرة الرئيسة في الفقرة السابقة ؟',
                    "pilihan" => [
                        "الناس لايعرف هذه النعمة",
                        "إنّ نبيّ الله داوود كان يأكل من عمل يده",
                        "بعض النّاس لا يحبون العمل",
                        "العمل خير في الحياة",
                    ],
                    "jawaban" => "العمل خير في الحياة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => 'الجملة المناسبة بالفقرة السابقة ؟',
                    "pilihan" => [
                        "ينبغي علينا أن نأكل مما كسبنا",
                        "ينبغي علينا أن نأكل ما أعطانا الجار",
                        "ينبغي علينا أن نأكل مما كسب الأب",
                        "ينبغي علينا أن نسأل الآخر",
                    ],
                    "jawaban" => "ينبغي علينا أن نأكل مما كسبنا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>هناك خرافات تحدث دائما بين الآباء والأبناء. فالآباء ينظرون إلى الأبناء على أنهم كبار، وينسون فارقة السن بينهم، ويريدون من الأبناء أن يكونوا صورة ثانية منهم. والأبناء ينظرون إلى الأباء على أنهم من عصر قديم، وأنهم يفكرون تفكيرا متأخرا، ولايمكن أن يتفقوا معهم فى الرأى. وهذه هي أهم أسباب الخلاف. ولكن إذا نظر الأباء إلى أبنائهم نظرة أخرى ليفهموهم بطريقة أفضل، وإذا تذكروا كيف أنهم كانوا فى نفس هذا الموقف من آبائهم، لأدركوا أنهم يجب أن يغيروا معاملتهم لأبنائهم، ويكونوا أكثر صبرا وفهما. أما الأبناء فيجب أن يدركوا أن طاعة الوالدين من طاعة الله، أنهم فى كثير من الأحيان لايعرفون ماينفعهم وما يضرهم، وإذا أطاعوا أبويهم كان ذلك خيرا لهم وأفضل.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => 'أفضل العنوان للفقرات السابقة :',
                    "pilihan" => [
                        "نظرة الآباء إلى الأبناء",
                        "نظرة الأبناء إلى الآباء",
                        "اختلاف الرأي بين الآباء والأبناء",
                        "تفكير الآباء المتأخر",
                    ],
                    "jawaban" => "اختلاف الرأي بين الآباء والأبناء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => 'خطأ الآباء فى نظرتهم للأبناء .......',
                    "pilihan" => [
                        "أنهم يأمرون أولادهم دائما بدون سبب",
                        "أنهم يحسبون جيدا فارقا لسن بينهم",
                        "أنهم ينظرون إلى الأبناء على أنهم كبار",
                        "أنهم لايحبون لأولادهم أن يكونوا مثلهم",
                    ],
                    "jawaban" => "أنهم ينظرون إلى الأبناء على أنهم كبار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => 'خطأ الأبناء فى نظرتهم الآباء ...........',
                    "pilihan" => [
                        "أنهم نالوا السهولة أن يتّفقوا معهم فى الرأي",
                        ". أن الآباء يفكرون تفكيرا متأخرا",
                        "أنّ الآباء يجب أن يكونوا أكثر صبرا",
                        "أن الآباء يتمنون لهم الخير",
                    ],
                    "jawaban" => ". أن الآباء يفكرون تفكيرا متأخرا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => 'التعبير المناسب من هذه القراءة ؟',
                    "pilihan" => [
                        "ينبغي على الأبناء أن يطيعوا آبائهم",
                        "ينبغي على الأبناء أن يرحوا آبائهم",
                        "ينبغي على الأبناء أن يستمعوا إلى آبائهم",
                        "ينبغي على الأبناء أن لا يطيعوا آبائهم",
                    ],
                    "jawaban" => "ينبغي على الأبناء أن يطيعوا آبائهم",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>تأثّر العالم كثيرا – وخاصّة أوروبا – بحضارة المسلمين. وكان المسلمون في العصر العباسي، قد نشروا العلم والثقافة في مناطق واسعة، فقد وصلوا إلى الصين في الشّرق، وإلى بلاد السّودان في إفريقيا في الجانوب.</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'الفكرة الرئيسة في الفقرة السابقة تتحدّث عن ......',
                    "pilihan" => [
                        "انتشار الحضارة الإسلاميّة في العالم",
                        "انتشار الإسلام في العالم",
                        "انتشار العلم والثقافة في الصين",
                        "انتشار العلم والثقافة في أوروبا",
                    ],
                    "jawaban" => "انتشار الحضارة الإسلاميّة في العالم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => 'أين يقع بلاد السودان ؟',
                    "pilihan" => [
                        "في إفريقيا",
                        "في شرق الأوسط",
                        "في الدول الغربي",
                        "في آسيا",
                    ],
                    "jawaban" => "في إفريقيا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>فكّر صديقي <u>أن يترك</u> العمل في الحكومة، وأن يعمل<u> تاجرا</u>، وفعلا فتح محلا صغيرا، لبيع الملابس، وبدأ يعامل النّاس معاملة طيبة، يبيع لهم الملابس رخيصة، فاشتهر كثيرا بين النّاس. وبعد سنة ترك صديقي المحلّ الصّغير، وفتح محلا كبيرا في وسط المدينة، وبعد ثلاث سنوات أنشأ شركة كبيرة لصناعة الملابس. أصبح صديقي <u>من أغنياء المدينة</u>، وقد أحبّه النّاس كثيرا، فهو رجل كريم يساعد النّاس في بناء المساجد والمدارس والمستشفيات.</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'كم سنة أنشأت تلك الشركة ؟',
                    "pilihan" => [
                        "سنة واحدة",
                        "ب.سنتين",
                        "ثلاث سنوات",
                        "أربع سنوات",
                    ],
                    "jawaban" => "ثلاث سنوات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => 'وصف الرجل في هذه الفقرة بأنه رجل ؟',
                    "pilihan" => [
                        "جميل",
                        "شريف",
                        "حكيم",
                        "لطيف",
                    ],
                    "jawaban" => "شريف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => '"من أغنياء المدينة " ؟',
                    "pilihan" => [
                        "اسم أصبح",
                        "خبر أصبح",
                        "مبتدأ مؤخر",
                        "بدل",
                    ],
                    "jawaban" => "خبر أصبح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => 'ما عمل هذا الرجل قبل أن يكون تاجرا؟',
                    "pilihan" => [
                        "الموظف الحكومي",
                        "الموظف الأهلي",
                        "رجال العمل",
                        "مهندس",
                    ],
                    "jawaban" => "الموظف الحكومي",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>حسن طالب إندونسي يدرس في الجامعة الإسلامية بالمدينة المنورة سافر حسن إلى المدينة المنورة قبل ثلاث سنوات لتعليم اللغة العربية ويدرس الإسلام. يتحدث حسن العربية الآن جيدا، وقد بدأ حفظ القرآن في بلده، والآن يحفظه كله. أصبح حسن الآن يفهم أحاديث الرسول صلى الله عليه وسلم، ويقرأ الكتب العربية والمجلات الأسبوعية والصحف اليومية. بعد هذه السنوات الثلاث يستطيع حسن أن يكتب باللغة العربية. فقد كتب إلى أصدقائه وقال لهم: "إن اللغة العربية لغة سهلة، وهي لغة العبادة لأكثر من مليار من المسلمين ولغة القرآن والإسلام.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => 'حسن طالب مسلم من اندونيسيا، وهي تقع في قارة ؟',
                    "pilihan" => [
                        "آسيا",
                        "أفريقا",
                        "أوربا",
                        "أوستراليا",
                    ],
                    "jawaban" => "آسيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => ' يدرس حسن في المرحلة ؟',
                    "pilihan" => [
                        "المتوسطة",
                        "الثانوية",
                        "الجامعية",
                        "الإبتدائية",
                    ],
                    "jawaban" => "الجامعية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => 'متى حضر حسن الى المدينة المنورة؟',
                    "pilihan" => [
                        "قبل ثلاث سنوات",
                        "قبل أشهر",
                        "قبل سنتين",
                        "قبل أربع سنوات",
                    ],
                    "jawaban" => "قبل ثلاث سنوات",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>تخرج زوجتي كل يوم في الصّباح، ولا ترجع إلا في السّاعة الخامسة مساءً، هذه مشكلتي معها. نحن نتناول الوجبات خارج البيت: لأنّ زوجتي لا تجد وقتاً لإعداد الطّعام، وأنا أغسل ملابسي وملابس أبنائنا وحدي، وأنظّف البيت أحياناً بعد التدريس ظهرا. لا أجد وقتا للحديث معها في أمور البيت والأسرة: لأنها عندما ترجع تكون متعبةً  .أمّا في عطلة الأسبوع، فهي تحبّ أن تزور الأهل والصّديقات، أو تذهب إلى السّوق، أو تحضّر دروس الأسبوع القادم أو تعالج المرضى في البيت.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => 'ماذا تعمل هذه الزّوجة ..؟',
                    "pilihan" => [
                        "موظّفة",
                        "مدرّسة",
                        "ممرّضة",
                        "طبيبة",
                    ],
                    "jawaban" => "طبيبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => ' ماذا يعمل هذا الزّوج....؟',
                    "pilihan" => [
                        "طبيبا",
                        "طيارا",
                        "مدرسا",
                        "فلاحا ",
                    ],
                    "jawaban" => "مدرسا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => 'يعمل الزّوج في ....؟',
                    "pilihan" => [
                        "الصبّاح",
                        "المساء",
                        "الصّباح والمساء",
                        "غير معين",
                    ],
                    "jawaban" => "الصبّاح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => 'متى تعود الزّوجة إلى البيت  ؟',
                    "pilihan" => [
                        "بعد العصر",
                        "بعد الظّهر",
                        "بعد المغرب",
                        "بعد العشاء",
                    ],
                    "jawaban" => "بعد العصر",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_istimav2(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>إختبار  اللغة العربية لغير الناطقين بها</center></p>
                    <p><center>القسم الأول : فهم المسموع</center></p>
                    <p><center>في هذا القسم 50 سؤالا تتكون من ثلاثة أنواع : التعبيرات، و الحوارات، و الفقرات:</center></p>
                    <p><center>للإجابة عن الأسئلة من رقم واحد إلى رقم خمسة وعشرين، استمع إلى التعبيرات ثم اختر أنسب جواب بعد كل تعبير :</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "",
                    "pilihan" => [
                        "إبراهيم طالب ماهر",
                        "إبراهيم أمهر من الآخرين",
                        "الآخرون أمهر من إبراهيم",
                        "طالب أمهر إبرهيم",
                    ],
                    "jawaban" => "إبراهيم أمهر من الآخرين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "",
                    "pilihan" => [
                        "أن الأستاذ لا يوجد في حفلة استقبال الطلاب الجدد",
                        "الأستاذ يحضر في حفلة استقبال الطلاب الجدد",
                        "أن الأستاذ يوجد في حفلة استقبال الطلاب الجدد",
                        "لا توجد حفلة استقبال الطلاب الجدد",
                    ],
                    "jawaban" => "أن الأستاذ لا يوجد في حفلة استقبال الطلاب الجدد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "",
                    "pilihan" => [
                        "إنه سيصبح طبيبا",
                        "إنه ليس طبيب",
                        "إنه طبيب",
                        "هو سيكون طبيبا",
                    ],
                    "jawaban" => "إنه طبيب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "",
                    "pilihan" => [
                        "لاعب كرة القدم",
                        "حارس المرمى",
                        "مشاهد",
                        "مدرب",
                    ],
                    "jawaban" => "مدرب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "",
                    "pilihan" => [
                        "سيسكن في الفندق",
                        "سيأكل في المطعم",
                        "سيستأجر السيارة",
                        "سيذهب إلى خارج البلاد",
                    ],
                    "jawaban" => "سيسكن في الفندق",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "",
                    "pilihan" => [
                        "هو ذاهب إلى الجامعة",
                        "هو لا يريد أن يذهب إلى الجامعة",
                        "هو لا يذهب إلى الجامعة بسبب المطر",
                        "المطر غزير حتى الآن",
                    ],
                    "jawaban" => "هو لا يذهب إلى الجامعة بسبب المطر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة السادسة",
                        "في الساعة السادسة والنصف",
                        "في الساعة السابعة",
                        "في الساعة السابعة والنصف",
                    ],
                    "jawaban" => "في الساعة السادسة والنصف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "",
                    "pilihan" => [
                        "لغة النبي",
                        "أهمية اللغة العربية",
                        "نشأة اللغة العربية",
                        "اللغة الأجنبية",
                    ],
                    "jawaban" => "نشأة اللغة العربية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "",
                    "pilihan" => [
                        "مرحلة الشباب أهم مرحلة",
                        "مرحلة الشباب غير مهم",
                        "مرحلة الشباب مرحلة طويلة",
                        "مرحلة الشباب كمرحلة الشيوخة",
                    ],
                    "jawaban" => "مرحلة الشباب أهم مرحلة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "",
                    "pilihan" => [
                        "في المطعم",
                        "في الفصل",
                        "في المستشفى",
                        "في المكتبة",
                    ],
                    "jawaban" => "في المطعم",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "",
                    "pilihan" => [
                        "عشرون",
                        "واحدة و عشرون",
                        "اثنتان و عشرون",
                        "ثلاث و عشرون",
                    ],
                    "jawaban" => "ثلاث و عشرون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "",
                    "pilihan" => [
                        "ثلاثة كتب",
                        "خمسة كتب",
                        "ستة كتب",
                        "كتابين",
                    ],
                    "jawaban" => "ستة كتب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "",
                    "pilihan" => [
                        "يحاول أن يكون تاجرا",
                        "يحاول أن يكون موظفا حكوميا",
                        "يحاول أن يكون مهندسا",
                        "يحاول أن يكون طبيبا",
                    ],
                    "jawaban" => "يحاول أن يكون موظفا حكوميا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "",
                    "pilihan" => [
                        "اثنتا عشرة سنة",
                        "تسع سنوات",
                        "ست سنوات",
                        "ثلاث سنوات",
                    ],
                    "jawaban" => "اثنتا عشرة سنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "",
                    "pilihan" => [
                        "الأب يمنع الأولاد اللعب في الصباح",
                        "الأب يمنع الأولاد اللعب في النهار",
                        "الأب يمنع الأولاد اللعب في المساء",
                        "الأب لا يمنع الأولاد اللعب في المساء",
                    ],
                    "jawaban" => "الأب يمنع الأولاد اللعب في المساء",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "",
                    "pilihan" => [
                        "اشتري الحاسوب",
                        "باخرة",
                        "الجوال",
                        "سيارة كبيرة",
                    ],
                    "jawaban" => "الجوال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "",
                    "pilihan" => [
                        "رمضان",
                        "شعبان",
                        "شوال",
                        "رجب",
                    ],
                    "jawaban" => "شعبان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "",
                    "pilihan" => [
                        "مائة ألف",
                        "مائتي ألف",
                        "ثلاثمائة ألف",
                        "أربمعمائة ألف",
                    ],
                    "jawaban" => "مائتي ألف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "",
                    "pilihan" => [
                        "إنه سعيد لأن السماء مظلم",
                        "إنه سعيد لأن السماء بيضاء",
                        "إنه سعيد لأن السماء ممطر",
                        "إنه سعيد لأن السماء واضح",
                    ],
                    "jawaban" => "إنه سعيد لأن السماء واضح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "",
                    "pilihan" => [
                        "مرحلة الشباب",
                        "مرحلة الشيوخ",
                        "مرحلة الطفولة",
                        "مرحلة الدراسة",
                    ],
                    "jawaban" => "مرحلة الشباب",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "",
                    "pilihan" => [
                        "موظف",
                        "أستاذ",
                        "دكتور",
                        "طالب",
                    ],
                    "jawaban" => "طالب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "",
                    "pilihan" => [
                        "مهندس",
                        "مدرس",
                        "تاجر",
                        "فلاح",
                    ],
                    "jawaban" => "فلاح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "",
                    "pilihan" => [
                        "يوما واحدا",
                        "يومين",
                        "ثلاثة أيام",
                        "أربعة أيام",
                    ],
                    "jawaban" => "يومين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "",
                    "pilihan" => [
                        "طالبة",
                        "مدرسة",
                        "طبيبة",
                        "ممرضة",
                    ],
                    "jawaban" => "مدرسة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "",
                    "pilihan" => [
                        "الابنة وأمها",
                        "الابنة وأبها",
                        "الابنة وأختها",
                        "الابنة وجدتها",
                    ],
                    "jawaban" => "الابنة وأمها",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم ستة وعشرين إلى رقم ثلاثين، استمع إلى الحوار الآتي، الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 26-30.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "",
                    "pilihan" => [
                        "مريم وأبوها",
                        "مريم وأمها",
                        "مريم وصديقها",
                        "مريم وأختها",
                    ],
                    "jawaban" => "مريم وصديقها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "",
                    "pilihan" => [
                        "في المسجد",
                        "في البيت",
                        "الجامعة",
                        "الفصل",
                    ],
                    "jawaban" => "في البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "",
                    "pilihan" => [
                        "سيارة",
                        "قلنسوة",
                        "مسطرة",
                        "شنطة",
                    ],
                    "jawaban" => "شنطة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "",
                    "pilihan" => [
                        "في شهر يناير",
                        "في شهر مارس",
                        "في شهر يوني",
                        "في شهر أغسطس",
                    ],
                    "jawaban" => "في شهر يوني",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "",
                    "pilihan" => [
                        "في البيت",
                        "في التلفون",
                        "في السوق",
                        "في المدرسة",
                    ],
                    "jawaban" => "في التلفون",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>لإجابة عن الأسئلة من رقم واحد وثلاثين إلى رقم خمسة وثلاثين ، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 31-35.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "",
                    "pilihan" => [
                        "في الجامعة الإسلامية",
                        "في المدرسة المتوسطة",
                        "في الجامعة الأهلية",
                        "في المدرسة الثانوية",
                    ],
                    "jawaban" => "في الجامعة الإسلامية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "",
                    "pilihan" => [
                        "هو مدرّس",
                        "هو ممرض",
                        "هو مهندس",
                        "هو طبيب",
                    ],
                    "jawaban" => "هو طبيب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "",
                    "pilihan" => [
                        "في المدينة",
                        "في القرية",
                        "في قمة الجبل",
                        "شاطئ البحر",
                    ],
                    "jawaban" => "في المدينة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "",
                    "pilihan" => [
                        "من حديد",
                        "من بلاستيك",
                        "من جلد",
                        "من خشب",
                    ],
                    "jawaban" => "من خشب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "",
                    "pilihan" => [
                        "حديقة كبيرة",
                        "حديقة صغيرة",
                        "حديقة واسعة",
                        "حديقة نظيفة",
                    ],
                    "jawaban" => "حديقة كبيرة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم ستة وثلاثين إلى أربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 36-40.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "",
                    "pilihan" => [
                        "في المدرسة",
                        "في الجامعة",
                        "في المستشفى",
                        "في المطعم",
                    ],
                    "jawaban" => "في الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "",
                    "pilihan" => [
                        "شيء جميل",
                        "شيء كبير",
                        "شيء رائع",
                        "شيء ممل",
                    ],
                    "jawaban" => "شيء رائع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "",
                    "pilihan" => [
                        "إلى المطعم",
                        "إلى الدكان",
                        "إلى المكتبة",
                        "إلى النهر",
                    ],
                    "jawaban" => "إلى المكتبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "",
                    "pilihan" => [
                        "نعم، توجد المكتبة",
                        "نعم، لا توجد المكتبة",
                        "لا، توجد المكتبة",
                        "لا، لا توجد المكتبة",
                    ],
                    "jawaban" => "نعم، توجد المكتبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "",
                    "pilihan" => [
                        "داخل الجامعة",
                        "تحت الأشجار الكبيرة",
                        "جانب المسجد",
                        "وراء البيت",
                    ],
                    "jawaban" => "تحت الأشجار الكبيرة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم واحد وأربعين إلى خمسة وأربعين، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 41-45.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "",
                    "pilihan" => [
                        "في يوم الأربعاء",
                        "في يوم الخميس",
                        "في يوم الجمعة",
                        "في يوم السبت",
                    ],
                    "jawaban" => "في يوم الجمعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "",
                    "pilihan" => [
                        "الشقة الجميلة",
                        "عمل ميرم",
                        "المطار وما فيه",
                        "الاستقبال في المطار",
                    ],
                    "jawaban" => "الاستقبال في المطار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "",
                    "pilihan" => [
                        "إلى الجامعة",
                        "إلى الفندق",
                        "المطعم",
                        "الحمام",
                    ],
                    "jawaban" => "إلى الفندق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "",
                    "pilihan" => [
                        "طعام لذيذ",
                        "طعاما غربيا",
                        "طعاما شرقيا",
                        " طعام إندويسي",
                    ],
                    "jawaban" => "طعاما شرقيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "",
                    "pilihan" => [
                        "كمترجمة في السفارة",
                        "كمدرسة في المدرسة",
                        "كموظفة حكومية",
                        "كموظفة أهلية",
                    ],
                    "jawaban" => "كمترجمة في السفارة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم ستة وأربعين إلى خمسين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 46-50.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "",
                    "pilihan" => [
                        "في المطار",
                        "في الفندق",
                        "في المطعم",
                        "في الغرفة",
                    ],
                    "jawaban" => "في الفندق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "",
                    "pilihan" => [
                        "نعم الإنترنيت موجود",
                        "نعم الإنترنيت غير موجود",
                        "لا، الإنترنيت موجود",
                        "الإنترنيت موجود لكن قليل",
                    ],
                    "jawaban" => "نعم الإنترنيت موجود",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "",
                    "pilihan" => [
                        "في الصباح",
                        "في النهار",
                        "في المساء",
                        "في الليل",
                    ],
                    "jawaban" => "في المساء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "",
                    "pilihan" => [
                        "غرفة لشخصين",
                        "غرفة لشخص",
                        "غرفة لثلاثة أشخاص",
                        "غرفة لأربعة أشخاص",
                    ],
                    "jawaban" => "غرفة لشخص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "",
                    "pilihan" => [
                        "نفران",
                        "ثلاثة أنفار",
                        "أربعة أنفار",
                        "خمسة أنفار",
                    ],
                    "jawaban" => "ثلاثة أنفار",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv2(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>القسم الثاني : فهم التراكيب والتعبيرات</center></p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "قال تعالى : { و لا تمش في الأرض مرحا } كلمة مرحا هي؟",
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "تمييز",
                        "مفعول له",
                    ],
                    "jawaban" => "حال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "قال تعالى : { إن الله لا يستحيٓ أن يضرب مثلا ما بعوضة فما فوقها } فعل يستحيٓ في الآية الكريمة مضارع معتال الآخر :",
                    "pilihan" => [
                        "مرفوع و علامة رفعه ضمة ظاهرة",
                        "مجزوم وعلامة جزمه حذف حرف علة وهي الواو",
                        "مرفوع و علامة رفعه ضمة مقدرة",
                        "محزوم وعلامة جزمه حذف حرف علة وهي الألف",
                    ],
                    "jawaban" => "مرفوع و علامة رفعه ضمة مقدرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "بين هذه الجمل جملة صحيحة هي؟",
                    "pilihan" => [
                        "انتشر فايروس كورونا في الكل العالم",
                        "انتشر فايروس كورونا في الكل عالم",
                        "انتشر فايروس كورونا في كل العالم",
                        "انتشر فايروس كورونا في كل عالما",
                    ],
                    "jawaban" => "انتشر فايروس كورونا في كل العالم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "في مكة المكرمة كعبة. كلمة (كعبة) في الجملة؟ ",
                    "pilihan" => [
                        "مبتدأ مرفوع بالألف",
                        "خبر مقدم مرفوع بالضمة",
                        "مبتدأ مرفوع بالضمة المقدرة",
                        "مبتدأ مرفوع بالضمة الظاهرة",
                    ],
                    "jawaban" => "مبتدأ مرفوع بالضمة الظاهرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "قال تعالى : إن يشأ يذهبكم. كلمة (يذهبكم) في الجملة؟",
                    "pilihan" => [
                        "استدراكية",
                        "جواب الشرط",
                        "استئنافية",
                        "سببية",
                    ],
                    "jawaban" => "جواب الشرط",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "تسكن عائلة أحمد في شقة بسيطة. كلمة أحمد؟",
                    "pilihan" => [
                        "مجرور بالفتحة",
                        "مجرور بالكسرة",
                        "منصوب بالفتحة",
                        "منصوب بالكسرة",
                    ],
                    "jawaban" => "مجرور بالفتحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "..... الأمة إلى الشاب القوي الجاد",
                    "pilihan" => [
                        "نحتاج",
                        "أحتاج",
                        "تحتاج",
                        "يحتاج",
                    ],
                    "jawaban" => "تحتاج",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "..... معاذ بن جبل قاضيا إلى اليمن",
                    "pilihan" => [
                        "أرسلتْ",
                        "أرسلتا",
                        "أرسل",
                        "أرسلا",
                    ],
                    "jawaban" => "أرسل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "مشكلة أحمد ...  عن مشكلة حسن",
                    "pilihan" => [
                        "يختلف",
                        "يختلفان",
                        "يختلفون",
                        "تختلف",
                    ],
                    "jawaban" => "تختلف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "...... الشوارع مبسوطة في فترة جوكو ويدودو",
                    "pilihan" => [
                        "كان",
                        "كانا",
                        "كانوا",
                        "كانت",
                    ],
                    "jawaban" => "كانت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "قال : في ثلاثة مواضع أشد استحبابا. كلمة (استحبابا) هي:",
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "تمييز",
                        "مفعول له",
                    ],
                    "jawaban" => "تمييز",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "يشارك المواطن الدولة الإهتمام ... النظافة",
                    "pilihan" => [
                        "على",
                        "في",
                        "عن",
                        "الباء",
                    ],
                    "jawaban" => "الباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "سأزورك غدا ... الطعام",
                    "pilihan" => [
                        "إذن سأعدّك",
                        "إذن ستعدّك",
                        "إذن سأعدّه",
                        "إذن سأعدّها",
                    ],
                    "jawaban" => "إذن سأعدّك",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "كان هدف الطالب طلب العلم. الخبر في هذه الجملة؟",
                    "pilihan" => [
                        "كان",
                        "هدف",
                        "الطالب",
                        "طلب العلم",
                    ],
                    "jawaban" => "طلب العلم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "انتشر الخبر ... الناس",
                    "pilihan" => [
                        "الباء",
                        "في",
                        "إلى",
                        "على",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'شرح الأستاذ الدرس اليوم شرحا واضحا. "واضحا" في هذه الجملة؟',
                    "pilihan" => [
                        "نعت",
                        "ظرف",
                        "مفعول به",
                        "حال",
                    ],
                    "jawaban" => "نعت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "التحق ... المدراسة في الوقت المناسب",
                    "pilihan" => [
                        "الباء",
                        "في",
                        "إلى",
                        "على",
                    ],
                    "jawaban" => "الباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "قال تعالى :{وورث سليمان داوود}. كلمة داوود في الآية الكريمة هي؟",
                    "pilihan" => [
                        "فاعل",
                        "مفعول الذي لم يسم فاعله",
                        "مفعول به",
                        "مفعول له",
                    ],
                    "jawaban" => "مفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "قال تعالى :{فمنهم من يمشي على بطنه}. (من) في الآية الكريمة هي؟",
                    "pilihan" => [
                        "استفهامية",
                        "موصولة",
                        "شرطية",
                        "زائدة",
                    ],
                    "jawaban" => "موصولة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "قال تعالى :{وفجرنا الأرض عيونا}. كلمة (عيونا) في الآية الكريمة هي؟",
                    "pilihan" => [
                        "مفعول به",
                        "مفعول له",
                        "حال",
                        "تمييز",
                    ],
                    "jawaban" => "تمييز",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'كان الطلاب يريدون أن ينالوا مهنة طيبة وشريفة. ما الجمع من "مهنة"؟',
                    "pilihan" => [
                        "مهن",
                        "مهنات",
                        "ميهان",
                        "مهنة",
                    ],
                    "jawaban" => "مهن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "خير ... من يدلك على الخير",
                    "pilihan" => [
                        "الصحيب",
                        "الصحيبان",
                        "الصحيبون",
                        "الأصحاب",
                    ],
                    "jawaban" => "الأصحاب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "تمسك المسلمون على القرآن الكريم",
                        "تمسك المسلمون في القرآن الكريم",
                        "تمسك المسلمون بالقرآن الكريم",
                        "تمسك المسلمون إلى القرآن الكريم",
                    ],
                    "jawaban" => "تمسك المسلمون بالقرآن الكريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "أنهى محمد مرحلة تعليمية وانتقلا إلى المرحلة التي بعدها",
                        "أنهى محمد مرحلة تعليمية وانتقل إلى المرحلة التي بعده",
                        "أنهى محمد مرحلة تعليمية وانتقلا إلى المرحلة التي بعده",
                        "أنهى محمد مرحلة تعليمية وانتقل إلى المرحلة التي بعدها",
                    ],
                    "jawaban" => "أنهى محمد مرحلة تعليمية وانتقل إلى المرحلة التي بعدها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "يبيع البائع سلعته في السوق",
                        "يبيعان البائع سلعته في السوق",
                        "تبيع البائع سلعته في السوق",
                        "تبيعان البائع سلعته في السوق",
                    ],
                    "jawaban" => "يبيع البائع سلعته في السوق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "<u>زعمت</u> <u>أحمد</u> <u>حاضر</u> في <u>هذا</u> اللقاء. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "زعمت",
                        "أحمد",
                        "حاضر",
                        "هذا",
                    ],
                    "jawaban" => "حاضر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "<u>أصبحت</u> <u>الحق</u> بعدما <u>ساد</u> <u>الظلم</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "أصبحت",
                        "الحق",
                        "ساد",
                        "الظلم",
                    ],
                    "jawaban" => "أصبحت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "إنك <u>تعمل</u> وكأن <u>عملك</u> <u>بنيانا</u> <u>راسخ</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "تعمل",
                        "عملك",
                        "بنيانا",
                        "راسخ",
                    ],
                    "jawaban" => "بنيانا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "<u>ليتها</u> <u>كانت</u> <u>سمع</u> <u>كلآمي</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "ليتها",
                        "كانت",
                        "سمع",
                        "كلآمي",
                    ],
                    "jawaban" => "سمع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "<u>حاول</u> أحمد أن <u>يتعلم</u> <u>لغتين</u> <u>أجنبية</u> عربية و إنجليزية. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "حاول",
                        "يتعلم",
                        "لغتين",
                        "أجنبية",
                    ],
                    "jawaban" => "أجنبية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "<u>دعا</u> <u>الإسلام</u> <u>في</u> <u>النظافة</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "دعا",
                        "الإسلام",
                        "في",
                        "النظافة",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "وحث <u>الإسلام</u> المسلم على نظافة <u>جسده</u> وملبسه ومسكنه وبيئته التي <u>يعيش</u> <u>فيه</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "الإسلام",
                        "جسده",
                        "يعيش",
                        "فيه",
                    ],
                    "jawaban" => "فيه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "قبل الدخول - أهم مرحلة - في الحياة الزوجة - اختيار الزوجة",
                    "pilihan" => [
                        "أهم مرحلة احتيار الزوجة في الحياة الزوجة قبل الدخول",
                        "في الحياة الزوجة أهم مرحلة قبل الدخول احتيار الزوجة",
                        "احتيار الزوجة أهم مرحلة قبل الدخول في الحياة الزوجة",
                        "قبل الدخول أهم مرحلة في الحياة الزوجة احتيار الزوجة",
                    ],
                    "jawaban" => "احتيار الزوجة أهم مرحلة قبل الدخول في الحياة الزوجة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "تكمل - إن - إيمانك - تزوجت - وحياتك <br>الترتيب الصحيح من الكلمات السابقة هو....",
                    "pilihan" => [
                        "تكمل إيمانك إن تزوجت وحياتك",
                        "تزوجت إيمانك وحياتك إن تكمل",
                        "إيمانك و حياتك تكمل إن تزوجت",
                        "إن تزوجت تكمل إيمانك وحياتك",
                    ],
                    "jawaban" => "إن تزوجت تكمل إيمانك وحياتك",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "تنجح - حتى - في الإمتحان - تعلم - العربية <br>الترتيب الصحيح من الكلمات السابقة هو...",
                    "pilihan" => [
                        "تعلم في الإمتحان حتى تنجح العربية",
                        "تعلم العربية حتى تنجح في الإمتحان",
                        "العربية في الإمتحان تنجح حتى تعلم",
                        "في الإمتحان تنجح حت تعلم العربية",
                    ],
                    "jawaban" => "تعلم العربية حتى تنجح في الإمتحان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "والمرأة لا ينبغي لها أن تقبل من الأزواج . إلا من هو على خلق ودين. قال صلى الله عليه وسلم :( إذا أتاكم من ترضون خلقه ودينه فزوجوه. إن لا تفعلوا تكن فتنة في الأرض وفساد عريض). جملة الشرط في هذ الحديث هي؟",
                    "pilihan" => [
                        "المرأة لا ينبغي لها",
                        "إلا من هو على خلق ودين",
                        "قال صلى الله عليه وسلم",
                        "إذا أتاكم من ترضون خلقه ودينه",
                    ],
                    "jawaban" => "إذا أتاكم من ترضون خلقه ودينه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "هوايتي الجديدة هي أن ... إلى الخبر من راديو كل العطلة",
                    "pilihan" => [
                        "يستمع",
                        "تستمع",
                        "أستمع",
                        "نستمع",
                    ],
                    "jawaban" => "أستمع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'المسلمون يتبعون المذاهب الأربعة. ما المفرد من "المذاهب"؟',
                    "pilihan" => [
                        "مذهب",
                        "مذهبة",
                        "هذب",
                        "ذهب",
                    ],
                    "jawaban" => "مذهب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "تحتوي معظم <u>الوجبات</u> السريعة على نسبة كبيرة من الكربوهيدرات. الكلمة التي تحتها خط تعني؟ ",
                    "pilihan" => [
                        "الوظيفة",
                        "الأعمال",
                        "الأكلات",
                        "المفروضة",
                    ],
                    "jawaban" => "الأكلات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'تعلموا العربية لأنها جزء من من دينكم. ما الجمع من "جزء"؟',
                    "pilihan" => [
                        "أجزاء",
                        "جزوء",
                        "جزاء",
                        "أجزيات",
                    ],
                    "jawaban" => "أجزاء",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_qiroahv2(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>النص الأول :</center></p>
                    <p>ذهبت نملة صغيرة الى جدول ماء لتشرب وتستريح، بعد أن تعبت كثيرا فى جمع قوتها. فزلت قدمها وسقطت فى الماء، ولم يمكنها الخروج منه لأنها لا تعرف السباحة وكادت تغرق. وكانت حمامة بيضاء جميلة واقفة على حجر فى الماءن ورأت ما حصل للنملة. فرق لها قلبها وسعت فى خلاصها، فطارت الى البر ورجعت، وفى منقارها عود من الحشيش، مدته على الماء الى البر. فتعلقت به النملة وخرجت من الماء بسلام.</p>
                    <p>وفى يوم التالى، نزلت الحمامة على فرع شجرة تتظلل بأوراقها. فمر صياد من بعد ورآها. فوقف يصيب بندقية نحوها ليصيدها، وهي لم ترها فتطير. ولكن النملة التى خلصتها تلك الحمامة رأت الصياد وعرفت ما عزم عليه، فصعدت فى جسمه. ولما هم بإطلاق بندوقية، فرصته قرصة شديدة أفزعته، فتحرك فمالت الرصاصة ولم تصب الحمامة، بل نجت جزاء إحسانها الى النملة. </p>
                    <p>اختر أصح الأجوبة الآتية </p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "أين وقفت الحمامة ؟",
                    "pilihan" => [
                        "على الأشجار",
                        "على الماء",
                        "على الأوراق",
                        "على الحجر",
                    ],
                    "jawaban" => "على الحجر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "ذهبت النملة الصغيرة الى جدول لأن ......؟",
                    "pilihan" => [
                        "تريد النملة أن تشرب وتستريح",
                        "تريد الحمامة أن تلتقى بها",
                        "الصياد يصوب بندوقية",
                        "تغرق الحمامة",
                    ],
                    "jawaban" => "تريد النملة أن تشرب وتستريح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "لماذا يصوب الصياد البندوقية ؟",
                    "pilihan" => [
                        "لأنه سيصيد النملة",
                        "لأنه سيستريح فى الغابة",
                        "لأنه سيصيد الحمامة",
                        "لأنه سيذهب الى الجدول",
                    ],
                    "jawaban" => "لأنه سيصيد الحمامة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => " الرجل الذى كانت حرفته صيد الحيوان يسمى بــــــــــ........؟",
                    "pilihan" => [
                        "الراعى",
                        "الصياد",
                        "أهل الحيوان",
                        "صاحب الحيوان",
                    ],
                    "jawaban" => "الصياد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "صعدت النملة فى جسم الصياد لـــــــــــ.....؟",
                    "pilihan" => [
                        "يقتله",
                        "نجدته",
                        "تأكل",
                        "قرصته",
                    ],
                    "jawaban" => "قرصته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "كيف الحمامة عندما ترى النملة تقع فى الماء ؟",
                    "pilihan" => [
                        "رق لها قلبها وسعت فى خلاصها",
                        "تدعو الصياد لنجدتها",
                        "نزلت الحمامة على فرع شجرة",
                        "ترجع الى القفص ولا تبالى",
                    ],
                    "jawaban" => "رق لها قلبها وسعت فى خلاصها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "لا تستطيع النملة الخروج من الماء لأنها ؟",
                    "pilihan" => [
                        "تشرب الماء",
                        "تقرص الصياد",
                        "لا تعرف السباحة",
                        "تساعد الحمامة",
                    ],
                    "jawaban" => "لا تعرف السباحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "كيف تخرج النملة من الماء؟",
                    "pilihan" => [
                        "تدعو الحمامة",
                        "تتعلق بعود من الحشيش",
                        "تقرص الصياد",
                        "تشرب الماء",
                    ],
                    "jawaban" => "تتعلق بعود من الحشيش",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "أين المكان الذي يصود الصياد الحمامة ؟",
                    "pilihan" => [
                        "الغابة",
                        "النهر",
                        "الشجر",
                        "البر",
                    ],
                    "jawaban" => "الغابة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "كيف تجزى النملة إحسان الحمامة ؟",
                    "pilihan" => [
                        "زلت قدمها الى الماء",
                        "تسلمها من الصياد",
                        "تخرج من الماء",
                        "تأخذ عود من الحشيش",
                    ],
                    "jawaban" => "تسلمها من الصياد",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>النص الثانى :</center></p>
                    <p>كان مُصوِّر مسافرا وهو يحمل مبلغا كبيرا من النقود، في كيس علقه حول عنقه. فنزل ليلا ببلد لم يجد فيه خانا، فأنزله أحد الأهالي ضيفا عنده. ولما رأى أنه يحمل ذلك المال الكثير، لبث يرقبه حتى نام، ودخل عليه حجرته يستق الخطى لكيلا يستيقظ، وسلبه المال، وحمله بلطف وخفةن وألقاه فى الطريق بعيدا عن الدار. ولما استيقظ الرجل من نومه فى الصباح، وجد نفسه فى الطريق ولا مال معه. فذهب الى الحاكم وشكا اليه أمره. فسأل الحاكم: "أتعرف من مضيفك بالأمس؟" فقال: "لا، لكنّي مصور ماهر، أستطيع أن أصور لك أهل البيت الذى كنت فيه فتعرفهم أنت وعمالك"</p>
                    <p>ثم اختلى المصور فى غرفة، وصور كل أعضاء تلك الأسرة الخائنة. فعرضت الصورة على الأهالي فعرفهم، وجائوا بهم الى الحاكم، فأقروا بذنبهم، وردوا المال الى صاحبه، وعاقبهم الحاكم عقابا شديدا، لأنهم خانوا على من ائتمنهم على نفسه وماله </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "ماذا يحمل المصور في السفار ؟",
                    "pilihan" => [
                        "مبلغ كبير من النقود",
                        "مبلغ كبير من القرطاس",
                        "مبلغ كبير من الرغيف",
                        "مبلغ كبير من اللباس",
                    ],
                    "jawaban" => "مبلغ كبير من النقود",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "صور المصور أعضاء الأسرة الخائنة لأن ؟",
                    "pilihan" => [
                        "تضع الصورة على الجدار",
                        "تساعد المصور فى السفر",
                        "يريد قبض الأسرة الخائنة",
                        "يضع الصورة فى المعرض",
                    ],
                    "jawaban" => "يريد قبض الأسرة الخائنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "أين ذهب المصور بعد ما سلبت ماله ؟",
                    "pilihan" => [
                        "المقهى",
                        "الحاكم",
                        "المسجد",
                        "الخان",
                    ],
                    "jawaban" => "الحاكم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "ما الذى سلب من المصور ؟",
                    "pilihan" => [
                        "الملابس",
                        "الخان",
                        "المال",
                        "الصورة",
                    ],
                    "jawaban" => "المال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "كيف حال المصور بعد ما استيقظ من النوم؟",
                    "pilihan" => [
                        "لا مال معه",
                        "لا لباس معه",
                        "لا فراش معه",
                        "لا أهل معه",
                    ],
                    "jawaban" => "لا مال معه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "ماذا فعل المصور عن هذه المصيبة ؟",
                    "pilihan" => [
                        "بكى وعاد الى بيته",
                        "حمل المال فى كيس",
                        "رد المال الى الحاكم",
                        "شكا الى الحاكم عن أمره",
                    ],
                    "jawaban" => "شكا الى الحاكم عن أمره",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "الرجل الذي عدل العدالة يسمى بــــــــــ......؟",
                    "pilihan" => [
                        "النائب",
                        "الحاكم",
                        "المدرس",
                        "المسافر",
                    ],
                    "jawaban" => "الحاكم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "فذهب الى الحاكم وشكا اليه <u>أمره</u>. الضمير الذي تحت الخط يعود الى ؟",
                    "pilihan" => [
                        "أهل البيت",
                        "المضيف",
                        "المصور",
                        "الأهالى",
                    ],
                    "jawaban" => "المصور",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "أدرك المصور من نومه أنه؟ ",
                    "pilihan" => [
                        "فى الحكومة",
                        "فى الطريق",
                        "فى البيت",
                        "فى الغرفة",
                    ],
                    "jawaban" => "فى الطريق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "لا يدرك المصور أنه سلبه المال لأن ؟",
                    "pilihan" => [
                        "يصور",
                        "يسافر",
                        "يشكو",
                        "ينام",
                    ],
                    "jawaban" => "ينام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>النص الثالث: </p>
                    <p>كان عمر بن الخطاب (ض) رجلا شجاعا، وعندما أراد الهجرة من مكة الى المدينة، حمل سيفه وذهب ال الكعبة وطاف حول اليت سبعة أشواط ثم صلى الله.</p>
                    <p>وفى إحدى الليالي، خرج عمر يتفقده أحوال المسلمين وكان البرد شديدا فى تلك الليلة. شاهد عمر نارا فى الطريق، فأسرع اليها وعندما أقرب من النار رأى امرأة تجلس هي وأطفالها حول قدر على النار. وكان الأطفال يبكون ويصرخون. اقترب عمر من المرأة وقال لها: "السلام عليكم". فقالت له: "وعليكم السلام". ثم سألها: "لماذا يبكي هؤلاء الأطفال ؟ فأجبته: "إنهم جائعون". قال لها: وماذا فى القدر ؟ قالت له: فيه ماء يغلى، يستمع الأطفال الى صوته فينامون". انطلق عمر الى بيت الدقيق وأحضر دقيقا وزيتا. فتح عمر القدر وصب فيه الدقيق وعندما نضج طلب منها طبقا، صب فيه الطعام ثم طلي منها أن تطعم أطفالها. أكل الأطفال حتى شبعوا ثم أخذوا يضحكون ويلعبون حتى ناموا. شكرت المرأة عمر وقالت له: "جزاك الله خيرا"</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "كيف الجو حين يتفقد عمر أحوال المسلمين ؟",
                    "pilihan" => [
                        "هادئ",
                        "جاف",
                        "بريد شديد",
                        "حار شديد",
                    ],
                    "jawaban" => "بريد شديد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "اقترب عمر من المرأة لأن ؟",
                    "pilihan" => [
                        "الأطفال يبكون ويصرخون",
                        "صب الرقيق والزيت فى القدر",
                        "الأطفال يضحكون حتى ناموا",
                        "أحضر دقيقا وزيتا",
                    ],
                    "jawaban" => "الأطفال يبكون ويصرخون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "كم شوطا طاف عمر حول البيت قبل صلى الله ؟",
                    "pilihan" => [
                        "خمسة أشواط",
                        "ستة أشواط",
                        "سبعة أشواط",
                        "ثمانية أشواط",
                    ],
                    "jawaban" => "سبعة أشواط",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "متى يتفقد عمر أحوال المسلمين ؟",
                    "pilihan" => [
                        "فى صباح مبكر",
                        "فى الليل",
                        "فى النهار",
                        "فى المساء",
                    ],
                    "jawaban" => "فى الليل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "ماذا تطبخ المرأة لأطفالها قبل مجيئ عمر ؟",
                    "pilihan" => [
                        "الرز",
                        "الرغيف",
                        "البيض",
                        "الماء",
                    ],
                    "jawaban" => "الماء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "عمر رجل شجاع ويريد أن يهجر من",
                    "pilihan" => [
                        "الشام الى المكة",
                        "المدينة الى المكة",
                        "المكة الى المدينة",
                        "المكة الى الشام",
                    ],
                    "jawaban" => "المكة الى المدينة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "تطبخ المرأة الماء لأطفالها لأن ؟",
                    "pilihan" => [
                        "لا دقيقا ولا زيتا لها",
                        "تحب الماء المغلى",
                        "تصنع اللبن لأطفالها",
                        "تغتسل به لأن الجو بارد",
                    ],
                    "jawaban" => "لا دقيقا ولا زيتا لها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "صب <u>فيه</u> الطعام ثم طلب منها أن تطعم أطفالها. الضمير الذى تحت الخط يعود الى ؟",
                    "pilihan" => [
                        "الأطفال",
                        "الماء",
                        "الدقيق",
                        "الطبق",
                    ],
                    "jawaban" => "الأطفال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "من القصة السابقة عرفنا أن عمر ؟",
                    "pilihan" => [
                        "سخي للمساكين",
                        "خبير بما يعملون",
                        "بخيل",
                        "متكبر",
                    ],
                    "jawaban" => "سخي للمساكين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "ماذا يشعر الأطفال بعد ما أكلوا الطعام ؟",
                    "pilihan" => [
                        "يحزنون",
                        "يفرحون",
                        "يقلقون",
                        "يخافون",
                    ],
                    "jawaban" => "يفرحون",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>النص الرابع </center></p>
                    <p>في البيت أب وأم، ولكل واحد منهما عمل خاص. اشتغل الأب خارج البيت. فذهب الى الحقول أو الى المزارع أو قصد سوقا أو دكانا للتجارة أو توظف فى بعض الدواوين أو علم فى المدارس. وليست الأم مثل ذلك بل هي اشتغلت فى المنزل فرتب كل شيئ فى البيت ونظفته وغسلت الملابس الواسخة. ثم استعدت وابتدأت فى الطهي. أتمت الأم تلك الأعمال الكثيرة هي وحدها. أو ساعدتها ابنة لها،ثم استرحت من الأعمال. </p>
                    <p>فالواجب عليك أيتها الفتاة المتعلمة الإخلاص فى خدمة الأم. فإذا اشتغلت معها وقبلت منها الإرشادات تقدمت وربحت بالعلوم والتجارب ربحا عظيما. </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "أين يشتغل الأب كل يوم ؟",
                    "pilihan" => [
                        "في البيت",
                        "في المزرعة",
                        "خارج البيت",
                        "فى السوق",
                    ],
                    "jawaban" => "خارج البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "تعمل الأم عمل البيت وتسمى بــــــــــ......؟ ",
                    "pilihan" => [
                        "تاجرة",
                        "ربة البيت",
                        "عمال",
                        "موطفة",
                    ],
                    "jawaban" => "ربة البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "ماذا تعمل الأم بعد ما أتمت من الأعمال الكثيرة ؟ ",
                    "pilihan" => [
                        "تغسل الملابس",
                        "تنظف البيت",
                        "تربي أبنائها",
                        "تستريح",
                    ],
                    "jawaban" => "تستريح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "أين توظف الأب ؟",
                    "pilihan" => [
                        "السوق",
                        "المزرعة",
                        "بعض الدواوين",
                        "الدكان",
                    ],
                    "jawaban" => "بعض الدواوين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "لا تعمل الأم خارج البيت لأن ؟",
                    "pilihan" => [
                        "تنام فى البيت",
                        "تشتغل فى عمل البيت",
                        "تستريح فى البيت",
                        "تغسل الملابس",
                    ],
                    "jawaban" => "تشتغل فى عمل البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "أين يعمل الأب التجارة ؟",
                    "pilihan" => [
                        "السوق",
                        "المدرسة",
                        "الحقول",
                        "المزارع",
                    ],
                    "jawaban" => "السوق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "أين اشتغلت الأم كل يوم ؟",
                    "pilihan" => [
                        "المزرعة",
                        "السوق",
                        "المدرسة",
                        "البيت",
                    ],
                    "jawaban" => "البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "من التى تساعد الأم فى عملية البيت ؟",
                    "pilihan" => [
                        "الأب",
                        "الابنة",
                        "الابن",
                        "الصديقة",
                    ],
                    "jawaban" => "الابنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "ما الذى اشتغل الأب ؟",
                    "pilihan" => [
                        "اشتغل الأب المزارع",
                        "اشتغل الأب عمل البيت",
                        "اشتغل الأب عمل خارج البيت",
                        "اشتغل الأب عمل الإدارى",
                    ],
                    "jawaban" => "اشتغل الأب عمل خارج البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "استرحت الأم من الأعمال الكثيرة لأن ؟",
                    "pilihan" => [
                        "أتمت جميع عمالها",
                        "ذهبت الى المزارع",
                        "وظفت فى الدواوين",
                        "علمت فى المدرسة",
                    ],
                    "jawaban" => "أتمت جميع عمالها",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>النص الخامس </center></p>
                    <p>زاد عدد المسلمين فى العالم فى الأعوام الماضية الى حوالي المليار والنصف. وحسب التقديرات الجديدة سيبلغ هذا العدد حوالي ملياري مسلم فى كل أنحاء العالم قبل نهاية القرن الحالي. وغالبية المسلمين أي 90 بالمائة تقريبا تتبع مذهبا من مذاهب أهل السنة الاساسية الأربعة التي ضاع أسسها كل من أبي حنيفة النعمان بن ثابت (ت. 767 م) ومالك بن أنس (ت. 795م) ومحمد بن إدريس الشافعي (ت. 820م) وأحمد بن حنبل (ت. 855م) حسب الترتيب التاريخي. </p>
                    <p>ونبي الإسلام هو محمد بن عبد الله ن عبد المطلب بن هاشم ﷺ وهو من بنى هاشم من قريش فى مكة المكرمة. وبعد أن دعا محمد ﷺ أهل مكة الى الإسلام هاجر فى سنة 622م الى يثرب، وهذه السنة هي بداية التقويم الهجري على أساس السنة القمرية أي 354 يوما، وبقي هناك الى أن توفي عام 632م. بعد وفاة النبى خلفه أبو بكر الصديق  (632-634م) ثم عمر بن الخطاب (634-633م) ثم عثمان بن عفان (644-656م) ثم علي بن أبي طالب (656-662م) </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "من أية القبيلة نبي محمد ؟",
                    "pilihan" => [
                        "مرة",
                        "قريش",
                        "غسان",
                        "محرب بن خفصة",
                    ],
                    "jawaban" => "قريش",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "أية سنة بدأ التقويم الهجري ؟",
                    "pilihan" => [
                        "304",
                        "634",
                        "622",
                        "661",
                    ],
                    "jawaban" => "622",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "كم عدد المسلمين فى الأعوام الماضية ؟",
                    "pilihan" => [
                        "مليون تقريبا",
                        "حوالى مليار والنصف",
                        "مليار والربع",
                        "ربع مليار",
                    ],
                    "jawaban" => "حوالى مليار والنصف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "يبدل اسم يثرب بسمى ؟",
                    "pilihan" => [
                        "القاهرة",
                        "المكة",
                        "اللبنان",
                        "المدينة",
                    ],
                    "jawaban" => "المدينة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "كان المسلمون تتبع .......مذاهب السنة الأساسية",
                    "pilihan" => [
                        "أربعة",
                        "أربع",
                        "ثلاثة",
                        "ثلاث",
                    ],
                    "jawaban" => "أربعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "الرجل الذى يبدل النبى فى قيادة البلاد يسمى بـــــــــــ...؟",
                    "pilihan" => [
                        "رئيس الجمهور",
                        "رئيس البلاد",
                        "الخليفة",
                        "النائب",
                    ],
                    "jawaban" => "الخليفة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "من الخليفة الثالث من خلفاء الرسول ؟",
                    "pilihan" => [
                        "أبو بكر",
                        "عثمان بن عفان",
                        "عمر بن خطاب",
                        "على بن أبى طالب",
                    ],
                    "jawaban" => "عثمان بن عفان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "الخليفة الذي قاد الحكومة أقل فترة هو؟",
                    "pilihan" => [
                        "أبو بكر",
                        "عثمان بن عفان",
                        "عمر بن خطاب",
                        "على بن ابي طالب",
                    ],
                    "jawaban" => "أبو بكر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "كم سنة يكون أبو بكر خليفة ؟",
                    "pilihan" => [
                        "سنة واحدة",
                        "سنتين اثنتين",
                        "ثلاث سنوات",
                        "أربع سنوات",
                    ],
                    "jawaban" => "ثلاث سنوات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "الخليفة الذي قاد الحكومة أطول فترة هو؟",
                    "pilihan" => [
                        "أبو بكر",
                        "عمر بن خطاب",
                        "عثمان بن عفان",
                        "على بن ابي طالب",
                    ],
                    "jawaban" => "عثمان بن عفان",
                ]
            ],
        ];

        return $data;
    }

}
/* End of file Soal_model.php */
